In [17]:
import pandas as pd
import connectorx as cx
import psycopg2
from sqlalchemy import create_engine

In [39]:
#RedShift

conn = psycopg2.connect(
    host="insight-prod-redshift-cluster.cn2blbeyznim.us-east-1.redshift.amazonaws.com",
    port = 5439,
    database="prod_analytics",
    user="chungjing",
    password="ZVuZ52mz9vqWiWpH"
)

x = f"""
SELECT DISTINCT a.login, b."name",a.db 
FROM prod_phoenix.uk_detail a
left join prod_phoenix.infinox_account b 
on a.db_n_login  = b.db_n_login 
WHERE a.status LIKE 'A%'; 
"""


redshift = pd.read_sql_query(x,conn)
conn.close()

redshift['login'] = redshift['login'].astype(int)

C:\Users\chungjing.ong\AppData\Local\Temp\ipykernel_14184\3478520833.py:20: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  redshift = pd.read_sql_query(x,conn)

In [40]:
len(redshift)

900

In [37]:
#CRM Infinox
import pandas as pd
from sqlalchemy import create_engine

# Define the URI string
CONN_CRM = 'mysql://inx_data_r:G{7yU40yER2NCJzl<ODk3u6D97>j@35.178.160.107:35011'

# Define your SQL query
query = """
select tam.mt4_account ,tu.real_name, tam.mt4_group, tam.mt4_datasource_id , 'FCA' as reg,
CASE
        WHEN tam.mt4_datasource_id  = 300 THEN 'ICN'
        WHEN tam.mt4_datasource_id  = 301 THEN 'IUK'
        WHEN tam.mt4_datasource_id  = 302 THEN 'BHS'
        WHEN tam.mt4_datasource_id  = 303 THEN 'BHS3'
        WHEN tam.mt4_datasource_id  = 304 THEN 'BHSCN'
        WHEN tam.mt4_datasource_id  = 305 THEN 'INF06'
        WHEN tam.mt4_datasource_id  = 350 THEN 'INFINOX_MT5'
        ELSE 'Unknown'
    END AS db
from inx_fca_business.tb_account_mt4 tam
inner join inx_fca_business.tb_user tu
ON tam.user_id = tu.id
where tam.mt4_account is not null 
and tam.mt4_datasource_id is not null
union 
select tam2.mt4_account ,tu2.real_name, tam2.mt4_group, tam2.mt4_datasource_id , 'FCA' as reg,
CASE
        WHEN tam2.mt4_datasource_id  = 300 THEN 'ICN'
        WHEN tam2.mt4_datasource_id  = 301 THEN 'IUK'
        WHEN tam2.mt4_datasource_id  = 302 THEN 'BHS'
        WHEN tam2.mt4_datasource_id  = 303 THEN 'BHS3'
        WHEN tam2.mt4_datasource_id  = 304 THEN 'BHSCN'
        WHEN tam2.mt4_datasource_id  = 305 THEN 'INF06'
        WHEN tam2.mt4_datasource_id  = 350 THEN 'INFINOX_MT5'
        ELSE 'Unknown'
    END AS db
from inx_fsc_business.tb_account_mt4 tam2 
inner join inx_fsc_business.tb_user tu2
ON tam2.user_id = tu2.id
where tam2.mt4_account is not null 
and tam2.mt4_datasource_id is not null
union 
select tam3.mt4_account ,tu3.real_name, tam3.mt4_group, tam3.mt4_datasource_id , 'FCA' as reg,
CASE
        WHEN tam3.mt4_datasource_id  = 300 THEN 'ICN'
        WHEN tam3.mt4_datasource_id  = 301 THEN 'IUK'
        WHEN tam3.mt4_datasource_id  = 302 THEN 'BHS'
        WHEN tam3.mt4_datasource_id  = 303 THEN 'BHS3'
        WHEN tam3.mt4_datasource_id  = 304 THEN 'BHSCN'
        WHEN tam3.mt4_datasource_id  = 305 THEN 'INF06'
        WHEN tam3.mt4_datasource_id  = 350 THEN 'INFINOX_MT5'
        ELSE 'Unknown'
    END AS db
FROM inx_scb_business.tb_account_mt4 tam3 
INNER JOIN inx_fsc_business.tb_user tu3 
ON tam3.user_id = tu3.id
where tam3.mt4_account is not null 
and tam3.mt4_datasource_id is not null
"""
try:
    # Create a SQLAlchemy engine using the URI
    engine = create_engine(CONN_CRM)

    # Use pandas to execute the SQL query using the engine
    CRM = pd.read_sql_query(query, engine)

    # Now you have the result in the 'CRM' DataFrame

except Exception as e:
    print(f"Error: {e}")

CRM

,mt4_account,real_name,mt4_group,mt4_datasource_id,reg,db
0,123,Mohammad Kalim,M_BHVFX_USD,302,FCA,BHS
1,217,Trader Enfinium Markets Uk P L Eur,M_BHVFX_EUR,301,FCA,IUK
2,517,Equitimax - Red Strategy,P_BHVFX_PRO_GBP,301,FCA,IUK
3,518,Equitimax - Gold Strategy,M_BHVFX_PRO_GBP,301,FCA,IUK
4,525,Traderpanel Uk Mam Master,MAM_REMOVED_GBP,301,FCA,IUK
...,...,...,...,...,...,...
292281,1000076454,Don Bhekisipho Mangena,M_ZA_ISO2_USD,303,FCA,BHS3
292282,2000000006,Robert Smith,MCBHVFX_GBP,301,FCA,IUK
292283,2000000022,Vengatajalapathy Devarajan,M_PK_SF_17_USD,302,FCA,BHS
292284,2000000023,Varun Singh,M_PK_SF_10P_USD,302,FCA,BHS
292285,2000000024,Surbhi Nigam,M_UK_AJ15_USD,302,FCA,BHS

In [57]:
CONN_TP = 'mysql://DataMY_read:qeC18ub3n3@192.168.1.179:3306'

query1 = """
select mt4_account , real_name ,crm_server, 
case 
	WHEN server = 300 THEN 'ICN'
    WHEN server = 301 THEN 'IUK'
    WHEN server = 302 THEN 'BHS'
    WHEN server = 303 THEN 'BHS3'
    WHEN server = 304 THEN 'BHSCN'
    WHEN server = 305 THEN 'INF06'
    WHEN server = 350 THEN 'INFINOX_MT5'
    ELSE 'Unknown'
end as DB

from `user`.crm_client_detail ccd 
where server in (300,301,302,303,304,305,350)
"""

try:
    # Create a SQLAlchemy engine using the URI
    engine1 = create_engine(CONN_TP)

    # Use pandas to execute the SQL query using the engine
    TP = pd.read_sql_query(query1, engine1)

    # Now you have the result in the 'CRM' DataFrame

except Exception as e:
    print(f"Error: {e}")
    
TP

,mt4_account,real_name,crm_server,DB
0,500511.0,Chenxi Shu,SCB,ICN
1,678420.0,Zhiwen Lai,SCB,ICN
2,692655.0,Zhongbao Tong #,SCB,ICN
3,685762.0,Ping Li,SCB,ICN
4,501566.0,Mei Han,SCB,ICN
...,...,...,...,...
343357,87003527.0,vkifcajuly TEST,FCA,INFINOX_MT5
343358,87003937.0,Mariana Rodriguez TEST,FCA,INFINOX_MT5
343359,9021923.0,testcrm clairetestjfdf,FCA,INFINOX_MT5
343360,87008692.0,Ahlatci Yatirim Menkul Degerler A.S,FCA,INFINOX_MT5
343361,9021924.0,testcrm clairetestsdff,FCA,INFINOX_MT5

In [59]:
# merged_df = pd.merge(redshift, CRM, left_on=['login', 'db'], right_on=['mt4_account', 'db'], how='left')
# merged_df.to_excel('redshift_crm.xlsx',index = False)

merged_df1 = pd.merge(redshift, TP, left_on=['login', 'db'], right_on=['mt4_account', 'DB'], how='left')
merged_df1.to_excel('redshift_TP.xlsx',index = False)